////////////////////////////////////////////////////////////////////////////////
///
/**
  \file 
  \brief Класс параметров конвертации.
*/
//
////////////////////////////////////////////////////////////////////////////////
#pragma once

#include <LibConverterParamInterface.h>

////////////////////////////////////////////////////////////////////////////////
//
/// Класс параметров конвертации.
/**
  Реализует библиотечный интерфейс параметров.
*/
////////////////////////////////////////////////////////////////////////////////
class LibConverterParam final : ILibConverterParam
{
  int32_t m_count = 0; ///< Счётчик копий указателей на класс.

public:
  /// Методы базового интерфейса KsAPI.

  /// Увеличить счётчик ссылок на объект.
  virtual void AddRef() override;
  /// Уменьшить счётчик ссылок на объект и разрушить его, если счётчик станет равным нулю.
  virtual void Release() override;
  /// Вернуть указатель на базовый класс KsAPI для this, если указанный параметр соответствует типу объекта.
  virtual ksapi::IAPIObject * QueryInterface(ksapi::IAPIObjectIID iid) override;


  /// Методы библиотечного интерфейса.

  /// Получить признак сохранения линий стиля.
  virtual bool GetSaveLineStyle() override;
  /// Установить признак сохранения линий стиля.
  virtual void SetSaveLineStyle(bool newValue) override;
};
