////////////////////////////////////////////////////////////////////////////////
//
/**
  \file 
  \brief Реализация класса библиотечных параметров конвертации.

  Реализует как методы KsAPI интерфейса, так и библиотечного.
*/
//
////////////////////////////////////////////////////////////////////////////////
#include <LibConverterParam.h>
#include <LibConverter.h>

//------------------------------------------------------------------------------
/**
  Увеличить счётчик ссылок на объект.
*/
//---
void LibConverterParam::AddRef()
{
  ++m_count;
}

//------------------------------------------------------------------------------
/**
  Уменьшить счётчик ссылок на объект и разрушить его, если счётчик станет равным нулю.
*/
//---
void LibConverterParam::Release()
{
  if (--m_count == 0)
    delete this;
}

//------------------------------------------------------------------------------
/**
  Вернуть указатель на базовый класс KsAPI для this, если указанный параметр соответствует типу объекта.
*/
//---
ksapi::IAPIObject * LibConverterParam::QueryInterface(ksapi::IAPIObjectIID iid)
{
  return iid == ksapi::IID_IAPIObject || iid == IID_ILibConverterParam ? this : nullptr;
}

//------------------------------------------------------------------------------
/**
  Получить признак сохранения линий стиля.
*/
//---
bool LibConverterParam::GetSaveLineStyle()
{
  return GetLibConverter().GetSaveLineStyle();
}

//------------------------------------------------------------------------------
/**
  Установить признак сохранения линий стиля.
*/
//---
void LibConverterParam::SetSaveLineStyle(bool newValue)
{
  GetLibConverter().SetSaveLineStyle(newValue);
}
