////////////////////////////////////////////////////////////////////////////////
///
/**
  \file 
  \brief Идентификаторы ресурсов.

  Загрузка и связывание строковых ресурсов с идентификаторами происходит в LoadResources.
*/
//
////////////////////////////////////////////////////////////////////////////////
#pragma once

#define IDI_SAVE           1   ///< Команда библиотеки "сохранить файл".
#define IDI_OPEN           2   ///< Команда библиотеки "открыть файл".
#define IDR_LIBID          100 ///< Идентификатор библиотеки.
#define IDS_ERROR_DOC_TYPE 104 ///< Ошибка "невозможно конвертировать текущий файл в заданный формат".
#define IDS_ERR_DOC        105 ///< Ошибка "документ не активизирован".
#define IDS_STYLE_DOC      106 ///< Текст диалога сохранения параметров.
#define IDS_DOC_M3D        107 ///< Фильтр для документов mym3d".
#define IDS_DOC_A3D        108 ///< Фильтр для документов mya3d".
#define IDS_DOC_CDW        109 ///< Фильтр для документов mycdw".
#define IDS_DOC_FRW        110 ///< Фильтр для документов myfrw".
#define IDS_DOC_SPW        111 ///< Фильтр для документов myspw".
#define IDS_DOC_KDW        112 ///< Фильтр для документов mykdw".
#define IDS_DOC_T3D        113 ///< Фильтр для документов myt3d".
#define IDS_DLG_CAPTION    114 ///< Заголовок диалога параметров.
#define IDS_DLG_BTN_YES    116 ///< Текст кнопки диалога параметов "сохранять".
#define IDS_DLG_BTN_NO     117 ///< Текст кнопки диалога параметров "не сохранять".
