////////////////////////////////////////////////////////////////////////////////
///
/**
  \file 
  \brief Идентификаторы ресурсов.

  Загрузка и связывание строковых ресурсов с идентификаторами происходит в LoadResources.
*/
//
////////////////////////////////////////////////////////////////////////////////
#pragma once

#define IDI_SAVE                  1   ///< Команда библиотеки.
#define IDR_LIBID                 100 ///< Идентификатор библиотеки.
#define IDS_NO_GET_API            101 ///< Ошибка "не получен интерфейс API".
#define IDS_NO_GET_CONVERTER      102 ///< Ошибка "не получен интерфейс конвертера".
#define IDS_NO_GET_CONVERT_PARAMS 103 ///< Ошибка "не получен интерфейс параметров конвертера".
#define IDS_STYLE_DOC             104 ///< Текст диалога "сохранять стиль линий ?".
#define IDS_DLG_BTN_YES           105 ///< Кнопка диалога "сохранять".
#define IDS_DLG_BTN_NO            106 ///< Кнопка диалога "не сохранять".
#define IDS_CONVERT_SUCCESS       107 ///< Текст сообщения об успешной конвертации.
#define IDS_CONVERT_ERROR         108 ///< Текст сообщения об неудачной конвертации.
