/////////////////////////////////////////////////////////////////////////////
//
// EventsList - Список подписчиков
// BaseEvent - Базовый класс для обработчиков событий в автоматизации
//
/////////////////////////////////////////////////////////////////////////////
#include "BaseEvent.h"

using namespace ksapi;


//-------------------------------------------------------------------------------
// Список подписчиков
// ---
std::vector<BaseEvent *> BaseEvent::m_eventList;


/////////////////////////////////////////////////////////////////////////////
//
// Базовый класс для автоматизационных обработчиков событий
//
/////////////////////////////////////////////////////////////////////////////
//-------------------------------------------------------------------------------
// Конструктор
// ---
BaseEvent::BaseEvent(const IAPIObjectPtr & container)
  : m_container(container)
{
  m_eventList.push_back(this);
}


//-------------------------------------------------------------------------------
// Деструктор
// ---
BaseEvent::~BaseEvent()
{
  RemoveThis();
  m_container = nullptr;
}


//-------------------------------------------------------------------------------
// Удалить себя из списка
// ---
void BaseEvent::RemoveThis()
{
  // Удалим себя из списка обработчиков событий
  auto pos = std::find(m_eventList.begin(), m_eventList.end(), this);
  if (pos != m_eventList.end())
    m_eventList.erase(pos);
}


//-------------------------------------------------------------------------------
//
// ---
void BaseEvent::Clear()
{
  m_container = nullptr;
}

//-------------------------------------------------------------------------------
// Рассоединиться
// ---
void BaseEvent::Disconnect()
{
  Unadvise();
  Clear();
}

//-----------------------------------------------------------------------------
// отписать все события
// ---
void BaseEvent::TerminateEvents()
{
  for (auto ev : m_eventList)
    ev->Disconnect();
  m_eventList.clear();
}


//-----------------------------------------------------------------------------
// Отписать все события
// ---
void BaseEvent::TerminateEvents(const IAPIObjectPtr & container)
{
  if (container)
  {
    for (auto ev : m_eventList)
      if (ev->m_container == container)
        ev->Disconnect();
    // В деструкторе будет удален из списка
  }
}
